applications/rust/src/integration/benchmark.yaml
config:
  target: ""
  phases:
    - duration: 15
      arrivalRate: 1
      rampTo: 10
      name: Warm up
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Burn
    - duration: 60
      arrivalRate: 30
      name: Sustained
    - duration: 15
      arrivalRate: 10
      rampTo: 50
      name: Spike
    - duration: 20
      arrivalRate: 5
      name: End

  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - name: Add and remove from the cart
    flow:
      -loop:
        - post:
            url: '/cart/create_cart'
            json: '{{ $randomUUID() }}'
            capture:
              - json: "$.sort_key"
                as: id
        - get:
            url: '/cart/get_cart/{{ id }}'
        - post:
            url: '/cart/add_to_cart/{{ id }}'
            json:
        - post:
            url: '/cart/remove_from_cart/{{ id }}'
  - name: Navigate around the website